package com.example.fridge_partner.model;

import com.example.fridge_partner.entity.RecipeEntity;

import java.util.ArrayList;
import java.util.List;

public class RecipeModelManager {

    public static List<RecipeEntity> getData() {
        List<RecipeEntity> models = new ArrayList<>();
        models.add(
                new RecipeEntity(1L,
                        "https://i2.chuimg.com/1926bfcc8f874c59b6948a6d23e5f512_690w_919h.jpg?imageView2/1/w/640/h/520/q/75/format/jpg",
                        "糖醋茄子",
                        "下饭湘菜【小炒攸县香干】，随手一炒就好吃！的做法步骤\n" +
                                "步骤 1\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "攸县香干斜切片，比较容易入味 · 买不到攸县香干，也可以用普通香干或者鸡蛋干来代替\n" +
                                "\n" +
                                "步骤 2\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "杭椒和红美人椒、蒜苗斜切成马耳朵型 如果不能吃辣，可以用青红彩椒替代\n" +
                                "\n" +
                                "步骤 3\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "五花肉去皮切薄片 · 五花肉在冰箱里冻硬之后会更好切\n" +
                                "\n" +
                                "步骤 4\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "铁锅烧热，干锅倒入杭椒和红尖椒，干锅炕2分钟，用锅铲压一压，炕出虎皮纹路起锅待用 这样制作出来的辣椒，可减低辣椒的辛辣和青涩味，更加有农家风味\n" +
                                "\n" +
                                "步骤 5\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "铁锅洗净，烧热倒入食用油滑锅，倒出食用油后，加入少许冷油，加入五花肉片大火翻炒2分钟至微微卷曲，煸出油脂\n" +
                                "\n" +
                                "步骤 6\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "调小火加入1小勺蒜末、姜末、1大勺郫县豆瓣酱炒出红油，再加入1小勺甜面酱炒散\n" +
                                "\n" +
                                "步骤 7\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "加入香干和少许清水，大火翻炒1-2分钟入味\n" +
                                "\n" +
                                "步骤 8\n" +
                                "纯奶手撕吐司的做法 步骤1\n" +
                                "加入1小勺生抽、1小勺蚝油、1/2小勺盐、1小勺糖，锅边淋入1小勺料酒，大火翻炒入味，起锅前加入炕好的杭椒和青蒜苗翻炒1分钟出锅。小炒攸县香干，完成！\n" +
                                "\n" +
                                "下饭湘菜【小炒攸县香干】，随手一炒就好吃！的小贴士\n" +
                                "1. 同学们无需被红红绿绿的辣椒吓到哦，这道菜只有一点微辣提味，并不烧胃，如果不想吃辣，就把双椒换成青红彩椒，味道也同样好。\n" +
                                "\n" +
                                "2.攸县香干可以通过网购或者大一点的生鲜app买到。\n" +
                                "\n")

        );



        models.add(new RecipeEntity(2L, "https://i2.chuimg.com/d8dedf3b7776438bb6db41c3f2eb99e6_1280w_960h.jpg?imageView2/1/w/640/h/520/q/75/format/jpg", "家常小炒合菜", "下饭湘菜【小炒攸县香干】，随手一炒就好吃！的做法步骤\n" +
                "步骤 1\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "攸县香干斜切片，比较容易入味 · 买不到攸县香干，也可以用普通香干或者鸡蛋干来代替\n" +
                "\n" +
                "步骤 2\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "杭椒和红美人椒、蒜苗斜切成马耳朵型 如果不能吃辣，可以用青红彩椒替代\n" +
                "\n" +
                "步骤 3\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "五花肉去皮切薄片 · 五花肉在冰箱里冻硬之后会更好切\n" +
                "\n" +
                "步骤 4\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "铁锅烧热，干锅倒入杭椒和红尖椒，干锅炕2分钟，用锅铲压一压，炕出虎皮纹路起锅待用 这样制作出来的辣椒，可减低辣椒的辛辣和青涩味，更加有农家风味\n" +
                "\n" +
                "步骤 5\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "铁锅洗净，烧热倒入食用油滑锅，倒出食用油后，加入少许冷油，加入五花肉片大火翻炒2分钟至微微卷曲，煸出油脂\n" +
                "\n" +
                "步骤 6\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "调小火加入1小勺蒜末、姜末、1大勺郫县豆瓣酱炒出红油，再加入1小勺甜面酱炒散\n" +
                "\n" +
                "步骤 7\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "加入香干和少许清水，大火翻炒1-2分钟入味\n" +
                "\n" +
                "步骤 8\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "加入1小勺生抽、1小勺蚝油、1/2小勺盐、1小勺糖，锅边淋入1小勺料酒，大火翻炒入味，起锅前加入炕好的杭椒和青蒜苗翻炒1分钟出锅。小炒攸县香干，完成！\n" +
                "\n" +
                "下饭湘菜【小炒攸县香干】，随手一炒就好吃！的小贴士\n" +
                "1. 同学们无需被红红绿绿的辣椒吓到哦，这道菜只有一点微辣提味，并不烧胃，如果不想吃辣，就把双椒换成青红彩椒，味道也同样好。\n" +
                "\n" +
                "2.攸县香干可以通过网购或者大一点的生鲜app买到。\n" +
                "\n"));
        models.add(new RecipeEntity(3L, "https://i2.chuimg.com/9bb3db1ca6814940b1a2286f084e2080_1280w_960h.jpg?imageView2/1/w/640/h/520/q/75/format/jpg", "风味茄子", "下饭湘菜【小炒攸县香干】，随手一炒就好吃！的做法步骤\n" +
                "步骤 1\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "攸县香干斜切片，比较容易入味 · 买不到攸县香干，也可以用普通香干或者鸡蛋干来代替\n" +
                "\n" +
                "步骤 2\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "杭椒和红美人椒、蒜苗斜切成马耳朵型 如果不能吃辣，可以用青红彩椒替代\n" +
                "\n" +
                "步骤 3\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "五花肉去皮切薄片 · 五花肉在冰箱里冻硬之后会更好切\n" +
                "\n" +
                "步骤 4\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "铁锅烧热，干锅倒入杭椒和红尖椒，干锅炕2分钟，用锅铲压一压，炕出虎皮纹路起锅待用 这样制作出来的辣椒，可减低辣椒的辛辣和青涩味，更加有农家风味\n" +
                "\n" +
                "步骤 5\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "铁锅洗净，烧热倒入食用油滑锅，倒出食用油后，加入少许冷油，加入五花肉片大火翻炒2分钟至微微卷曲，煸出油脂\n" +
                "\n" +
                "步骤 6\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "调小火加入1小勺蒜末、姜末、1大勺郫县豆瓣酱炒出红油，再加入1小勺甜面酱炒散\n" +
                "\n" +
                "步骤 7\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "加入香干和少许清水，大火翻炒1-2分钟入味\n" +
                "\n" +
                "步骤 8\n" +
                "纯奶手撕吐司的做法 步骤1\n" +
                "加入1小勺生抽、1小勺蚝油、1/2小勺盐、1小勺糖，锅边淋入1小勺料酒，大火翻炒入味，起锅前加入炕好的杭椒和青蒜苗翻炒1分钟出锅。小炒攸县香干，完成！\n" +
                "\n" +
                "下饭湘菜【小炒攸县香干】，随手一炒就好吃！的小贴士\n" +
                "1. 同学们无需被红红绿绿的辣椒吓到哦，这道菜只有一点微辣提味，并不烧胃，如果不想吃辣，就把双椒换成青红彩椒，味道也同样好。\n" +
                "\n" +
                "2.攸县香干可以通过网购或者大一点的生鲜app买到。\n" +
                "\n"));
        models.add(new RecipeEntity(4L, "https://i2.chuimg.com/f875d622100c44e9960affa513f5dcd6_1000w_1251h.jpg?imageView2/1/w/640/h/520/q/75/format/jpg", "番茄滑肉煲", "冬天最爱这样有肉有菜的一锅煮\uD83C\uDF72，\n" + "浓郁的番茄\uD83C\uDF45汤汁，肉片超级嫩滑，好鲜美，\n" + "热乎乎炖上一锅，酸爽开胃，吃完浑身都暖了~"));
        models.add(new RecipeEntity(5L, "https://i2.chuimg.com/2e7e6864cc164465955a1f2539a15f79_1242w_1656h.jpg?imageView2/1/w/640/h/520/q/75/format/jpg", "娃娃菜焖豆泡巨下饭", "娃娃菜焖豆泡巨下饭！的做法步骤"));
        return models;
    }
}
